---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCRange.End
source: html/b0b57633-20f0-49c1-5ea3-1acd8e16c2f5.htm
---
# Autodesk.Revit.DB.IFC.IFCRange.End Property

The ending value of the range.

## Syntax (C#)
```csharp
public double End { get; set; }
```